Merge remote-tracking branch 'upstream/dev' into zsh-maintain-10779
